# SQL-Structured Query Language
* Structured Query language (SQL) is a standardized programming language that is used to manage relational databases and perform various operations on the data in them.

In [1]:
import sqlite3

## Creating and connecting to database
* Database: student

In [2]:
con = sqlite3.connect('student.db')

In [3]:
con

## Create a cursor to execute sql query

In [4]:
cur = con.cursor() # data table connection ko lagi

# Creating table in database CREATE statement
```sql
CREATE TABLE table_naem(column_name1 datatype, column_2 datatype, ...column_name_n datatype)
```

In [ ]:
query = """ 
create table student_details 
(roll_no int, name varchar(50), gender varchar(5))
"""

In [ ]:
# create table command repeat garer run garn nuhune

# Insert statement in SQL
```INSERT into table_name (column_name_1 , colum_name_2 ... , column_name_n) 
values
    (value1, value2, .... , valuen)
    ```

In [10]:
insert_query = """
INSERT into student_details (roll_no, name, gender)
values
(1, 'dhruba', 'm'),
(2, 'Sharaddha', 'F'),
(3, 'Manzil', 'M'),
(4, 'Jyoti', 'F'),
(5, 'Darshan', 'M')
"""

In [11]:
cur.execute(insert_query)

# Select statement in SQL
```Select * from table_name```

In [13]:
cur.execute("select * from student_details")

In [16]:
cur.execute("select * from student_details").fetchall()

[(1, 'dhruba', 'm'),
 (2, 'Sharaddha', 'F'),
 (3, 'Manzil', 'M'),
 (4, 'Jyoti', 'F'),
 (5, 'Darshan', 'M')]

# where clause: Find all data with gender F

In [19]:
query = """
select name from student_details
where gender = 'F'
"""

In [20]:
cur.execute(query).fetchall()

[('Sharaddha',), ('Jyoti',)]

In [22]:
cur.execute("SELECT NAME FROM STUDENT_DETAILS WHERE GENDER = 'M'").fetchall()

[('Manzil',), ('Darshan',)]

# Upade statement
```sql
update table_name
set col_name = value
where colunm_name = <id value>
```

In [24]:
update_query = """
update student_details
set name = 'Dhruba karki'
where roll_no =1
"""

In [25]:
cur.execute(update_query)

In [26]:
cur.execute("select * from student_details").fetchall()

[(1, 'Dhruba karki', 'm'),
 (2, 'Sharaddha', 'F'),
 (3, 'Manzil', 'M'),
 (4, 'Jyoti', 'F'),
 (5, 'Darshan', 'M')]

# Delete statement

In [27]:
cur.execute("delete from student_details where roll_no = 1")

In [28]:
cur.execute("select * from student_details").fetchall()

[(2, 'Sharaddha', 'F'),
 (3, 'Manzil', 'M'),
 (4, 'Jyoti', 'F'),
 (5, 'Darshan', 'M')]

### check multiple condition using where clause
```the LIKE command is used in a WHERE clause to search for a specified pattern in a column.
you can use tow wildcards with LIKE:
% - Represents zero, one, or multiple characters
```

In [33]:
query = """
select * from student_details
where
gender = 'M' and name like 'D%'
"""

In [34]:
cur.execute(query).fetchall()

[(5, 'Darshan', 'M')]